GreatCowBASIC/DATFileGenerator/incfiles/p16F17524.inc
;----- APMPREH Bits -----------------------------------------------------
PRE8             EQU  H'0000'
PRE9             EQU  H'0001'
PRE10            EQU  H'0002'
PRE11            EQU  H'0003'
PRE12            EQU  H'0004'
PRE13            EQU  H'0005'
PRE14            EQU  H'0006'
PRE15            EQU  H'0007'
APMPRE8          EQU  H'0000'
APMPRE9          EQU  H'0001'
APMPRE10         EQU  H'0002'
APMPRE11         EQU  H'0003'
APMPRE12         EQU  H'0004'
APMPRE13         EQU  H'0005'
APMPRE14         EQU  H'0006'
APMPRE15         EQU  H'0007'


;----- APMPER Bits -----------------------------------------------------
PER0             EQU  H'0000'
PER1             EQU  H'0001'
PER2             EQU  H'0002'
PER3             EQU  H'0003'
PER4             EQU  H'0004'
PER5             EQU  H'0005'
PER6             EQU  H'0006'
PER7             EQU  H'0007'
APMPER0          EQU  H'0000'
APMPER1          EQU  H'0001'
APMPER2          EQU  H'0002'
APMPER3          EQU  H'0003'
APMPER4          EQU  H'0004'
APMPER5          EQU  H'0005'
APMPER6          EQU  H'0006'
APMPER7          EQU  H'0007'


;----- APMPERH Bits -----------------------------------------------------
PER8             EQU  H'0000'
PER9             EQU  H'0001'
PER10            EQU  H'0002'
PER11            EQU  H'0003'
PER12            EQU  H'0004'
PER13            EQU  H'0005'
PER14            EQU  H'0006'
PER15            EQU  H'0007'
APMPER8          EQU  H'0000'
APMPER9          EQU  H'0001'
APMPER10         EQU  H'0002'
APMPER11         EQU  H'0003'
APMPER12         EQU  H'0004'
APMPER13         EQU  H'0005'
APMPER14         EQU  H'0006'
APMPER15         EQU  H'0007'


;----- APMPERS2 Bits -----------------------------------------------------
SOSC             EQU  H'0000'
POSC             EQU  H'0001'
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'


;----- APMPERS2H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
CMP1             EQU  H'0005'
CMPLP1           EQU  H'0006'
ZCD              EQU  H'0007'


;----- APMPERS2U Bits -----------------------------------------------------
VREFLPDAC        EQU  H'0006'
VREFLP           EQU  H'0007'


;----- APMPERE2 Bits -----------------------------------------------------
SOSC             EQU  H'0000'
POSC             EQU  H'0001'
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERE2_2       EQU  H'0002'
APMPERE2_3       EQU  H'0003'
APMPERE2_4       EQU  H'0004'
APMPERE2_5       EQU  H'0005'
APMPERE2_6       EQU  H'0006'
APMPERE2_7       EQU  H'0007'


;----- APMPERE2H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
CMP1             EQU  H'0005'
CMPLP1           EQU  H'0006'
ZCD              EQU  H'0007'
APMPERE2_8       EQU  H'0000'
APMPERE2_10      EQU  H'0002'
APMPERE2_11      EQU  H'0003'
APMPERE2_13      EQU  H'0005'
APMPERE2_14      EQU  H'0006'
APMPERE2_15      EQU  H'0007'


;----- APMPERE2U Bits -----------------------------------------------------
VREFLPDAC        EQU  H'0006'
VREFLP           EQU  H'0007'


;----- APMCLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'
CLK5             EQU  H'0005'
CLK6             EQU  H'0006'
CLK7             EQU  H'0007'
APMCLK0          EQU  H'0000'
APMCLK1          EQU  H'0001'
APMCLK2          EQU  H'0002'
APMCLK3          EQU  H'0003'
APMCLK4          EQU  H'0004'
APMCLK5          EQU  H'0005'
APMCLK6          EQU  H'0006'
APMCLK7          EQU  H'0007'


;----- APMSTATUS Bits -----------------------------------------------------
SOSC             EQU  H'0000'
POSC             EQU  H'0001'
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMSTATUS_2      EQU  H'0002'
APMSTATUS_3      EQU  H'0003'
APMSTATUS_4      EQU  H'0004'
APMSTATUS_5      EQU  H'0005'
APMSTATUS_6      EQU  H'0006'
APMSTATUS_7      EQU  H'0007'


;----- APMSTATUSH Bits -----------------------------------------------------
OPA1             EQU  H'0000'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
CMP1             EQU  H'0005'
CMPLP1           EQU  H'0006'
ZCD              EQU  H'0007'
APMSTATUS_8      EQU  H'0000'
APMSTATUS_10     EQU  H'0002'
APMSTATUS_11     EQU  H'0003'
APMSTATUS_13     EQU  H'0005'
APMSTATUS_14     EQU  H'0006'
APMSTATUS_15     EQU  H'0007'


;----- APMSTATUSU Bits -----------------------------------------------------
OPA3             EQU  H'0000'
OPA4             EQU  H'0001'
VREFLPDAC        EQU  H'0006'
VREFLP           EQU  H'0007'


;----- STATUS_SHAD Bits -----------------------------------------------------
STATUS_SHAD0     EQU  H'0000'
STATUS_SHAD1     EQU  H'0001'
STATUS_SHAD2     EQU  H'0002'


;----- STKPTR Bits -----------------------------------------------------
STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'


;----- TOSL Bits -----------------------------------------------------
TOSL0            EQU  H'0000'
TOSL1            EQU  H'0001'
TOSL2            EQU  H'0002'
TOSL3            EQU  H'0003'
TOSL4            EQU  H'0004'
TOSL5            EQU  H'0005'
TOSL6            EQU  H'0006'
TOSL7            EQU  H'0007'


;----- TOSH Bits -----------------------------------------------------
TOSH0            EQU  H'0000'
TOSH1            EQU  H'0001'
TOSH2            EQU  H'0002'
TOSH3            EQU  H'0003'
TOSH4            EQU  H'0004'
TOSH5            EQU  H'0005'
TOSH6            EQU  H'0006'
TOSH7            EQU  H'0007'

